eeyrw/music-box-8051/STC15F_SDCC.h
#define Timer2_12T() AUXR &= ~(1 << 2) //Timer0 clodk = fo/12	12分频,	default

#define Timer2_InterruptEnable() IE2 |= (1 << 2) //允许Timer2中断.

#define Timer2_InterruptDisable() IE2 &= ~(1 << 2) //禁止Timer2中断.

#define ExternalRAM_enable() AUXR |= 2 //允许外部XRAM，禁止使用内部1024RAM

#define InternalRAM_enable() AUXR &= ~2 //禁止外部XRAM，允许使用内部1024RAM

#define T0_pulseP34_enable() AUXR2 |= 1 //允许 T0 溢出脉冲在T0(P3.5)脚输出，Fck0 = 1/2 T0 溢出率，T0可以1T或12T。

#define T0_pulseP34_disable() AUXR2 &= ~1

#define T1_pulseP35_enable() AUXR2 |= 2 //允许 T1 溢出脉冲在T1(P3.4)脚输出，Fck1 = 1/2 T1 溢出率，T1可以1T或12T。

#define T1_pulseP35_disable() AUXR2 &= ~2

#define T2_pulseP30_enable() AUXR2 |= 4 //允许 T2 溢出脉冲在T1(P3.0)脚输出，Fck2 = 1/2 T2 溢出率，T2可以1T或12T。

#define T2_pulseP30_disable() AUXR2 &= ~4

#define T0_pulseP35(n) ET0 = 0, Timer0_AsTimer(), Timer0_1T(), Timer0_16bitAutoReload(), TH0 = (65536 - (n / 2 + MAIN_Fosc / 2) / (n)) / 256, TL0 = (65536 - (n / 2 + MAIN_Fosc / 2) / (n)) % 256, AUXR2 |= bit0, TR0 = 1 //fx=fosc/(2*M)/n,  M=1 or M=12

#define T1_pulseP34(n) ET1 = 0, Timer1_AsTimer(), Timer1_1T(), Timer1_16bitAutoReload(), TH1 = (65536 - (n / 2 + MAIN_Fosc / 2) / (n)) / 256, TL1 = (65536 - (n / 2 + MAIN_Fosc / 2) / (n)) % 256, AUXR2 |= bit1, TR1 = 1 //fx=fosc/(2*M)/n,  M=1 or M=12

#define T2_pulseP30(n) Timer2_InterruptDisable(), Timer2_AsTimer(), Timer2_1T(), TH2 = (65536 - (n / 2 + MAIN_Fosc / 2) / (n)) / 256, TL2 = (65536 - (n / 2 + MAIN_Fosc / 2) / (n)) % 256, AUXR2 |= bit2, Timer2_Run() //fx=fosc/(2*M)/n,  M=1 or M=12

#define Timer0_Load(n) TH0 = (n) / 256, TL0 = (n) % 256

#define Timer1_Load(n) TH1 = (n) / 256, TL1 = (n) % 256

#define Timer2_Load(n) TH2 = (n) / 256, TL2 = (n) % 256

#define Timer0_Load_us(n) TH0 = (65536 - MainFosc_KHZ * (n) / 1000) / 256, TL0 = (65536 - MainFosc_KHZ * (n) / 1000) % 256

#define Timer1_Load_us(n) TH1 = (65536 - MainFosc_KHZ * (n) / 1000) / 256, TL1 = (65536 - MainFosc_KHZ * (n) / 1000) % 256

#define Timer2_Load_us(n) TH2 = (65536 - MainFosc_KHZ * (n) / 1000) / 256, TL2 = (65536 - MainFosc_KHZ * (n) / 1000) % 256

//sfr WDT_CONTR = 0xC1; //Watch-Dog-Timer Control register

//                                      7     6     5      4       3      2   1   0     Reset Value

//                                  WDT_FLAG  -  EN_WDT CLR_WDT IDLE_WDT PS2 PS1 PS0    xx00,0000

#define D_WDT_FLAG (1 << 7)

#define D_EN_WDT (1 << 5)

#define D_CLR_WDT (1 << 4) //auto clear

#define D_IDLE_WDT (1 << 3) //WDT counter when Idle

#define D_WDT_SCALE_2 0

#define D_WDT_SCALE_4 1

#define D_WDT_SCALE_8 2 //T=393216*N/fo

#define D_WDT_SCALE_16 3

#define D_WDT_SCALE_32 4

#define D_WDT_SCALE_64 5

#define D_WDT_SCALE_128 6

#define D_WDT_SCALE_256 7

#define WDT_reset(n) WDT_CONTR = D_EN_WDT + D_CLR_WDT + D_IDLE_WDT + (n) //初始化WDT，喂狗

//						  7     6      5    4     3      2    1     0     Reset Value

//sfr PCON   = 0x87;	SMOD  SMOD0  LVDF  POF   GF1    GF0   PD   IDL    0001,0000	 //Power Control

//SMOD		//串口双倍速

//SMOD0

#define LVDF (1 << 5) //P4.6低压检测标志

//POF

//GF1

//GF0

//#define 	D_PD		2		//set 1, power down mode

//#define 	D_IDLE		1		//set 1, idle mode

#define MCU_IDLE() PCON |= 1 //MCU 进入 IDLE 模式

#define MCU_POWER_DOWN() PCON |= 2 //MCU 进入 睡眠 模式

//sfr ISP_CMD   = 0xC5;

#define ISP_STANDBY() ISP_CMD = 0 //ISP空闲命令（禁止）

#define ISP_READ() ISP_CMD = 1 //ISP读出命令

#define ISP_WRITE() ISP_CMD = 2 //ISP写入命令

#define ISP_ERASE() ISP_CMD = 3 //ISP擦除命令

//sfr ISP_TRIG  = 0xC6;

#define ISP_TRIG() ISP_TRIG = 0x5A, ISP_TRIG = 0xA5 //ISP触发命令

//							  7    6    5      4    3    2    1     0    Reset Value

//sfr IAP_CONTR = 0xC7;		IAPEN SWBS SWRST CFAIL  -   WT2  WT1   WT0   0000,x000	//IAP Control Register

#define ISP_EN (1 << 7)

#define ISP_SWBS (1 << 6)

#define ISP_SWRST (1 << 5)

#define ISP_CMD_FAIL (1 << 4)

#define ISP_WAIT_1MHZ 7

#define ISP_WAIT_2MHZ 6

#define ISP_WAIT_3MHZ 5

#define ISP_WAIT_6MHZ 4

#define ISP_WAIT_12MHZ 3

#define ISP_WAIT_20MHZ 2

#define ISP_WAIT_24MHZ 1

#define ISP_WAIT_30MHZ 0

#if (MAIN_Fosc >= 24000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_30MHZ

#elif (MAIN_Fosc >= 20000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_24MHZ

#elif (MAIN_Fosc >= 12000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_20MHZ

#elif (MAIN_Fosc >= 6000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_12MHZ

#elif (MAIN_Fosc >= 3000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_6MHZ

#elif (MAIN_Fosc >= 2000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_3MHZ

#elif (MAIN_Fosc >= 1000000L)

#define ISP_WAIT_FREQUENCY ISP_WAIT_2MHZ

#else

#define ISP_WAIT_FREQUENCY ISP_WAIT_1MHZ

#endif

/* ADC Register */

//								7       6      5       4         3      2    1    0   Reset Value

//sfr ADC_CONTR = 0xBC;		ADC_POWER SPEED1 SPEED0 ADC_FLAG ADC_START CHS2 CHS1 CHS0 0000,0000	//AD 转换控制寄存器

//sfr ADC_RES  = 0xBD;		ADCV.9 ADCV.8 ADCV.7 ADCV.6 ADCV.5 ADCV.4 ADCV.3 ADCV.2	  0000,0000	//A/D 转换结果高8位

//sfr ADC_RESL = 0xBE;												  ADCV.1 ADCV.0	  0000,0000	//A/D 转换结果低2位

//sfr ADC_CONTR  = 0xBC;	//直接用MOV操作，不要用与或

//sfr SPCTL  = 0xCE;	SPI控制寄存器

//   7       6       5       4       3       2       1       0    	Reset Value

//	SSIG	SPEN	DORD	MSTR	CPOL	CPHA	SPR1	SPR0		0x00

#define SPI_SSIG_None() SPCTL |= (1 << 7) //1: 忽略SS脚

#define SPI_SSIG_Enable() SPCTL &= ~(1 << 7) //0: SS脚用于决定主从机

#define SPI_Enable() SPCTL |= (1 << 6) //1: 允许SPI

#define SPI_Disable() SPCTL &= ~(1 << 6) //0: 禁止SPI

#define SPI_LSB_First() SPCTL |= (1 << 5) //1: LSB先发

#define SPI_MSB_First() SPCTL &= ~(1 << 5) //0: MSB先发

#define SPI_Master() SPCTL |= (1 << 4) //1: 设为主机

#define SPI_Slave() SPCTL &= ~(1 << 4) //0: 设为从机

#define SPI_SCLK_NormalH() SPCTL |= (1 << 3) //1: 空闲时SCLK为高电平

#define SPI_SCLK_NormalL() SPCTL &= ~(1 << 3) //0: 空闲时SCLK为低电平

#define SPI_PhaseH() SPCTL |= (1 << 2) //1:

#define SPI_PhaseL() SPCTL &= ~(1 << 2) //0:

#define SPI_Speed(n) SPCTL = (SPCTL & ~3) | (n) //设置速度, 0 -- fosc/4, 1 -- fosc/16, 2 -- fosc/64, 3 -- fosc/128

//sfr SPDAT  = 0xCF; //SPI Data Register                                                     0000,0000

//sfr SPSTAT  = 0xCD;	//SPI状态寄存器

//   7       6      5   4   3   2   1   0    	Reset Value

//	SPIF	WCOL	-	-	-	-	-	-

#define SPIF 0x80 //SPI传输完成标志。写入1清0。

#define WCOL 0x40 //SPI写冲突标志。写入1清0。

