eeyrw/music-box-8051/STC15F_SDCC.h
#define SPI_USE_P12P13P14P15() AUXR1 &= ~0x0c //将SPI切换到P12(SS) P13(MOSI) P14(MISO) P15(SCLK)(上电默认)。

#define SPI_USE_P24P23P22P21() AUXR1 = (AUXR1 & ~0x0c) | 0x04 //将SPI切换到P24(SS) P23(MOSI) P22(MISO) P21(SCLK)。

#define SPI_USE_P54P40P41P43() AUXR1 = (AUXR1 & ~0x0c) | 0x08 //将SPI切换到P54(SS) P40(MOSI) P41(MISO) P43(SCLK)。

/*

;PCA_PWMn:    7       6     5   4   3   2     1       0

;			EBSn_1	EBSn_0	-	-	-	-	EPCnH	EPCnL

;B5-B2:		保留

;B1(EPCnH):	在PWM模式下，与CCAPnH组成9位数。

;B0(EPCnL):	在PWM模式下，与CCAPnL组成9位数。

*/

#define PWM0_NORMAL() PCA_PWM0 &= ~3 //PWM0正常输出(默认)

#define PWM0_OUT_0() PCA_PWM0 |= 3 //PWM0一直输出0

#define PWM0_OUT_1() PCA_PWM0 &= ~3, CCAP0H = 0 //PWM0一直输出1

#define PWM1_NORMAL() PCA_PWM1 &= ~3 //PWM0正常输出(默认)

#define PWM1_OUT_0() PCA_PWM1 |= 3 //PWM0一直输出0

#define PWM1_OUT_1() PCA_PWM1 &= ~3, CCAP1H = 0 //PWM1一直输出1

#define PWM2_NORMAL() PCA_PWM2 &= ~3 //PWM1正常输出(默认)

#define PWM2_OUT_0() PCA_PWM2 |= 3 //PWM2一直输出0

#define PWM2_OUT_1() PCA_PWM2 &= ~3, CCAP2H = 0 //PWM2一直输出1

//						7     6     5     4     3     2     1     0     Reset Value

//sfr CCON   = 0xD8;	CF    CR    -     -     -    CCF2  CCF1  CCF0   00xx,xx00	//PCA 控制寄存器。

__sbit __at(0xD8) CCF0;
__sbit __at(0xD9) CCF1;
__sbit __at(0xDA) CCF2;
__sbit __at(0xDE) CR;
__sbit __at(0xDF) CF;
//					 7     6     5     4     3     2     1     0    Reset Value

//sfr CMOD  = 0xD9;	CIDL   -     -     -   CPS2   CPS1  CPS0  ECF   0xxx,0000	//PCA 工作模式寄存器。

#define PCA_IDLE_OFF() CMOD |= (1 << 7) //IDLE状态PCA停止计数。

#define PCA_IDLE_ON() CMOD &= ~(1 << 7) //IDLE状态PCA继续计数。

#define PCA_CLK_12T() CMOD &= ~0x0E //PCA计数脉冲选择外部晶振/12。	fosc/12

#define PCA_CLK_2T() CMOD = (CMOD & ~0x0E) + 2 //PCA计数脉冲选择外部晶振/2。	fosc/2

#define PCA_CLK_T0() CMOD = (CMOD & ~0x0E) + 4 //PCA计数脉冲选择Timer0中断，Timer0可通过AUXR寄存器设置成工作在12T或1T模式。

#define PCA_CLK_ECI() CMOD = (CMOD & ~0x0E) + 6 //PCA计数脉冲选择从ECI/P3.4脚输入的外部时钟，最大 fosc/2。

#define PCA_CLK_1T() CMOD = (CMOD & ~0x0E) + 8 //PCA计数脉冲选择外部晶振。		Fosc/1

#define PCA_CLK_4T() CMOD = (CMOD & ~0x0E) + 10 //PCA计数脉冲选择外部晶振/4。	Fosc/4

#define PCA_CLK_6T() CMOD = (CMOD & ~0x0E) + 12 //PCA计数脉冲选择外部晶振/6。	Fosc/6

#define PCA_CLK_8T() CMOD = (CMOD & ~0x0E) + 14 //PCA计数脉冲选择外部晶振/8。	Fosc/8

#define PCA_INT_ENABLE() CMOD |= 1 //PCA计数器溢出中断允许位，1---允许CF（CCON.7）产生中断。

#define PCA_INT_DISABLE() CMOD &= ~1 //PCA计数器溢出中断禁止。

//					    7      6       5        4       3       2       1      0    Reset Value

//sfr AUXR1 = 0xA2;	  S1_S1  S1_S0  CCP_S1   CCP_S0  SPI_S1   SPI_S0    -     DPS   0100,0000	//Auxiliary Register 1

#define PCA_USE_P12P11P10P37() AUXR1 &= ~0x30 //将PCA/PWM切换到P12(ECI) P11(CCP0) P10(CCP1) P37(CCP2)(上电默认)。

#define PCA_USE_P34P35P36P37() AUXR1 = (AUXR1 & ~0x30) | 0x10 //将PCA/PWM切换到P34(ECI) P35(CCP0) P36(CCP1) P37(CCP2)。

#define PCA_USE_P24P25P26P27() AUXR1 = (AUXR1 & ~0x30) | 0x20 //将PCA/PWM切换到P24(ECI) P25(CCP0) P26(CCP1) P27(CCP2)。

#define DPS_SEL1() AUXR1 |= 1 //1：选择DPTR1。

#define DPS_SEL0() AUXR1 &= ~1 //0：选择DPTR0(上电默认)。

/*									7     6      5      4     3     2     1     0     Reset Value

//sfr CCAPM0 = 0xDA;	PWM 寄存器  -   ECOM0  CAPP0  CAPN0  MAT0  TOG0  PWM0  ECCF0   x000,0000	//PCA 模块0 

//sfr CCAPM1 = 0xDB;	PWM 寄存器  -   ECOM1  CAPP1  CAPN1  MAT1  TOG1  PWM1  ECCF1   x000,0000	//PCA 模块1

//sfr CCAPM2 = 0xDC;	PWM 寄存器  -   ECOM2  CAPP2  CAPN2  MAT2  TOG2  PWM2  ECCF2   x000,0000	//PCA 模块2

;ECOMn = 1:	允许比较功能。

;CAPPn = 1:	允许上升沿触发捕捉功能。

;CAPNn = 1:	允许下降沿触发捕捉功能。

;MATn  = 1:	当匹配情况发生时，允许CCON中的CCFn置位。

;TOGn  = 1:	当匹配情况发生时，CEXn将翻转。(CEX0/PCA0/PWM0/P3.7,CEX1/PCA1/PWM1/P3.5)

;PWMn  = 1:	将CEXn设置为PWM输出。

;ECCFn = 1:	允许CCON中的CCFn触发中断。

;ECOMn CAPPn CAPNn MATn TOGn PWMn ECCFn

;  0     0     0    0    0    0     0		00H	未启用任何功能。

;  x     1     0    0    0    0     x	 	20H	16位CEXn上升沿触发捕捉功能。

;  x     0     1    0    0    0     x	 	10H	16位CEXn下降沿触发捕捉功能。

;  x     1     1    0    0    0     x	 	30H	16位CEXn/PCAn边沿（上、下沿）触发捕捉功能。

;  1     0     0    1    0    0     x	 	48H	16位软件定时器。

;  1     0     0    1    1    0     x	 	4CH	16位高速脉冲输出。

;  1     0     0    0    0    1     0		42H	8位PWM。无中断

;  1     1     0    0    0    1     1		63H	8位PWM。低变高可产生中断

;  1     0     1    0    0    1     1		53H	8位PWM。高变低可产生中断

;  1     1     1    0    0    1     1		73H	8位PWM。低变高或高变低均可产生中断

;*******************************************************************

;*******************************************************************/

#define PCA0_none() CCAPM0 = 0

#define PCA0_PWM(nbit) CCAPM0 = 0x42, PCA_PWM0 = (PCA_PWM0 & 0x0c) | ((8 - nbit) << 6)

#define PCA0_PWM_rise_int(nbit) CCAPM0 = 0x63, PCA_PWM0 = (PCA_PWM0 & 0x0c) | ((8 - nbit) << 6)

#define PCA0_PWM_fall_int(nbit) CCAPM0 = 0x53, PCA_PWM0 = (PCA_PWM0 & 0x0c) | ((8 - nbit) << 6)

#define PCA0_PWM_edge_int(nbit) CCAPM0 = 0x73, PCA_PWM0 = (PCA_PWM0 & 0x0c) | ((8 - nbit) << 6)

#define PCA0_capture_rise() CCAPM0 = (0x20 + 1)

#define PCA0_capture_fall() CCAPM0 = (0x10 + 1)

#define PCA0_capture_edge() CCAPM0 = (0x30 + 1)

#define PCA0_16bit_Timer() CCAPM0 = (0x48 + 1)

#define PCA0_High_Pulse() CCAPM0 = (0x4C + 1)

#define PCA1_none() CCAPM1 = 0

#define PCA1_PWM(nbit) CCAPM1 = 0x42, PCA_PWM1 = (PCA_PWM1 & 0x0c) | ((8 - nbit) << 6)

#define PCA1_PWM_rise_int(nbit) CCAPM1 = 0x63, PCA_PWM1 = (PCA_PWM1 & 0x0c) | ((8 - nbit) << 6)

#define PCA1_PWM_fall_int(nbit) CCAPM1 = 0x53, PCA_PWM1 = (PCA_PWM1 & 0x0c) | ((8 - nbit) << 6)

#define PCA1_PWM_edge_int(nbit) CCAPM1 = 0x73, PCA_PWM1 = (PCA_PWM1 & 0x0c) | ((8 - nbit) << 6)

#define PCA1_capture_rise() CCAPM1 = (0x20 + 1)

#define PCA1_capture_fall() CCAPM1 = (0x10 + 1)

#define PCA1_capture_edge() CCAPM1 = (0x30 + 1)

#define PCA1_16bit_Timer() CCAPM1 = (0x48 + 1)

#define PCA1_High_Pulse() CCAPM1 = (0x4C + 1)

#define PCA2_none() CCAPM2 = 0

#define PCA2_PWM(nbit) CCAPM2 = 0x42, PCA_PWM2 = (PCA_PWM2 & 0x0c) | ((8 - nbit) << 6)

#define PCA2_PWM_rise_int(nbit) CCAPM2 = 0x63, PCA_PWM2 = (PCA_PWM2 & 0x0c) | ((8 - nbit) << 6)

#define PCA2_PWM_fall_int(nbit) CCAPM2 = 0x53, PCA_PWM2 = (PCA_PWM2 & 0x0c) | ((8 - nbit) << 6)

#define PCA2_PWM_edge_int(nbit) CCAPM2 = 0x73, PCA_PWM2 = (PCA_PWM2 & 0x0c) | ((8 - nbit) << 6)

