eeyrw/music-box-8051/STC15F_SDCC.h
#define PCA2_capture_rise() CCAPM2 = (0x20 + 1)

#define PCA2_capture_fall() CCAPM2 = (0x10 + 1)

#define PCA2_capture_edge() CCAPM2 = (0x30 + 1)

#define PCA2_16bit_Timer() CCAPM2 = (0x48 + 1)

#define PCA2_High_Pulse() CCAPM2 = (0x4C + 1)

/* Above is STC additional SFR or change */

/**********************************************************/

typedef unsigned char u8;

typedef unsigned int u16;

typedef unsigned long u32;

/**********************************************************/


/**********************************************/

/****************************************************************/

//sfr INT_CLKO = 0x8F;	//附加的 SFR WAKE_CLKO (地址：0x8F)

/*

    7   6    5    4   3     2        1       0         Reset Value

    -  EX4  EX3  EX2  -   T2CLKO   T1CLKO  T0CLKO      0000,0000B

b6 -  EX4      : 外中断INT4允许

b5 -  EX3      : 外中断INT3允许

b4 -  EX2      : 外中断INT2允许

b2 - T1CLKO    : 允许 T2 溢出脉冲在P3.0脚输出，Fck1 = 1/2 T1 溢出率

b1 - T1CLKO    : 允许 T1 溢出脉冲在P3.4脚输出，Fck1 = 1/2 T1 溢出率

b0 - T0CLKO    : 允许 T0 溢出脉冲在P3.5脚输出，Fck0 = 1/2 T0 溢出率

*/

#define LVD_InterruptEnable() ELVD = 1

#define LVD_InterruptDisable() ELVD = 0

//sfr WKTCL = 0xAA;	//STC11F\10和STC15系列 唤醒定时器低字节

//sfr WKTCH = 0xAB;	//STC11F\10和STC15系列 唤醒定时器高字节

//	B7		B6	B5	B4	B3	B2	B1	B0		B7	B6	B5	B4	B3	B2	B1	B0

//	WKTEN				S11	S10	S9	S8		S7	S6	S5	S4	S3	S2	S1	S0	n * 560us

#define WakeTimerDisable() WKTCH &= 0x7f //WKTEN = 0		禁止睡眠唤醒定时器

#define WakeTimerSet(scale) WKTCL = (scale) % 256, WKTCH = (scale) / 256 | 0x80 //WKTEN = 1	允许睡眠唤醒定时器

//sfr CLK_DIV = 0x97; //Clock Divder 系统时钟分频  -     -      -       -     -  CLKS2 CLKS1 CLKS0 xxxx,x000

#define SYSTEM_CLK_1T() CLK_DIV &= ~0x07 //default

#define SYSTEM_CLK_2T() CLK_DIV = (CLK_DIV & ~0x07) | 1

#define SYSTEM_CLK_4T() CLK_DIV = (CLK_DIV & ~0x07) | 2

#define SYSTEM_CLK_8T() CLK_DIV = (CLK_DIV & ~0x07) | 3

#define SYSTEM_CLK_16T() CLK_DIV = (CLK_DIV & ~0x07) | 4

#define SYSTEM_CLK_32T() CLK_DIV = (CLK_DIV & ~0x07) | 5

#define SYSTEM_CLK_64T() CLK_DIV = (CLK_DIV & ~0x07) | 6

#define SYSTEM_CLK_128T() CLK_DIV = CLK_DIV | 7

#define MCLKO_P54_None() CLK_DIV &= ~0xc0 //主时钟不输出

#define MCLKO_P54_DIV1() CLK_DIV = (CLK_DIV & ~0xc0) | 0x40 //主时钟不分频输出

#define MCLKO_P54_DIV2() CLK_DIV = (CLK_DIV & ~0xc0) | 0x80 //主时钟2分频输出

#define MCLKO_P54_DIV4() CLK_DIV = CLK_DIV | 0xc0 //主时钟4分频输出

#define MCLKO_P34_None() CLK_DIV &= ~0xc0 //主时钟不输出

#define MCLKO_P34_DIV1() CLK_DIV = (CLK_DIV & ~0xc0) | 0x40 //主时钟不分频输出

#define MCLKO_P34_DIV2() CLK_DIV = (CLK_DIV & ~0xc0) | 0x80 //主时钟2分频输出

#define MCLKO_P34_DIV4() CLK_DIV = CLK_DIV | 0xc0 //主时钟4分频输出

//sfr BUS_SPEED = 0xA1; //Stretch register      -   -  -  -   -   -  EXRTS1  EXRTSS0 xxxx,xx10

#define BUS_SPEED_1T() BUS_SPEED = 0

#define BUS_SPEED_2T() BUS_SPEED = 1

#define BUS_SPEED_4T() BUS_SPEED = 2

#define BUS_SPEED_8T() BUS_SPEED = 3

/*   interrupt vector */

#define INT0_VECTOR 0

#define TIMER0_VECTOR 1

#define INT1_VECTOR 2

#define TIMER1_VECTOR 3

#define UART1_VECTOR 4

#define ADC_VECTOR 5

#define LVD_VECTOR 6

#define PCA_VECTOR 7

#define UART2_VECTOR 8

#define SPI_VECTOR 9

#define INT2_VECTOR 10

#define INT3_VECTOR 11

#define TIMER2_VECTOR 12

#define INT4_VECTOR 16

#define UART3_VECTOR 17

#define UART4_VECTOR 18

#define TIMER3_VECTOR 19

#define TIMER4_VECTOR 20

#define CMP_VECTOR 21

#define TRUE 1

#define FALSE 0

//=============================================================

//========================================

#define PolityLow 0 //低优先级中断

#define PolityHigh 1 //高优先级中断

//========================================

#define MCLKO_None 0

#define MCLKO_DIV1 1

#define MCLKO_DIV2 2

#define MCLKO_DIV4 3

#define ENABLE 1

#define DISABLE 0

#define STC15F_L2K08S2 8

#define STC15F_L2K16S2 16

#define STC15F_L2K24S2 24

#define STC15F_L2K32S2 32

#define STC15F_L2K40S2 40

#define STC15F_L2K48S2 48

#define STC15F_L2K56S2 56

#define STC15F_L2K60S2 60

#define IAP15F_L2K61S2 61

#endif
